export type Dictionary = Record<string, RegExp>

export const Dictionary = {
	
	/**
		* @description 含有邮政编码
	 */
	hasChinaPostalCode: /[1-9]\d{5}(?!\d)/,
	
	/**
		* @description 邮政编码
	 */
	ChinaPostalCode: /[1-9]\d{5}(?!\d)/,

	/**
	 * @description  含有身份证(18位)
	 */
	hasIdentityCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,

	/**
	 * @description 身份证(18位)
	 */
	identityCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,

	/**
	 * @description 含有邮箱
	 */
	hasEmail: /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/,

	/**
	 * @description 邮箱
	 */
	email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,

	/**
	 * @description 含有16进制颜色的校验
	 */
	hasHexadecimalColor: /#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})/,

	/**
	 * @description 16进制颜色的校验
	 */
	HexadecimalColor: /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/,

	/**
	 * @description  含有手机号码
	 */
	hasPhone: /\d{11}|\d{13}/,
	/**
	 * @description 手机号码
	 */
	phone: /^\d{11}|\d{13}$/,

	/**
	 * @description 含有数字 ("10000.00" 和 "10,000.00")
	 */
	hasNumber: /^[-+]?([0-9]+|[0-9]{1,3}(,[0-9]{3})*)(.[0-9]{1,2})?$/,
	/**
	 * @description 数字 ("10000.00" 和 "10,000.00")
	 */
	number: /^[-+]?([0-9]+|[0-9]{1,3}(,[0-9]{3})*)(.[0-9]{1,2})?$/,

	/**
	 * @description 汉字
	 */
	Chinese: /^[\u4e00-\u9fa5]{1,}$/,

	/**
	 * @description 含有双字节字符(包含中文)
	 */
	// eslint-disable-next-line no-control-regex
	hasDoubleByteChar: /[^\x00-\xff]/,

	/**
	 * @description 双字节字符(包含中文)
	 */
	// eslint-disable-next-line no-control-regex
	doubleByteChar: /^[^\x00-\xff]{1,}$/,

	/**
	 * @description 含有全角符号
	 */
	hasFullWidthSymbol: /[\uFF00-\uFFFF]/,

	/**
	 * @description 全角符号
	 */
	FullWidthSymbol: /^[\uFF00-\uFFFF]{1,}$/,

	/**
	 * @description 含有半角符号
	 */
	// eslint-disable-next-line no-control-regex
	hasHalfWidthSymbol: /[\u0000-\u00FF]/,

	/**
	 * @description 半角符号
	 */
	// eslint-disable-next-line no-control-regex
	HalfWidthSymbol: /^[\u0000-\u00FF]{1,}$/,

	hasIpv4: /^((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$/,
	ipv4: /^((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$/,

	hasIpv6: /([\da-fA-F]{1,4}:){6}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^::([\da-fA-F]{1,4}:){0,4}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:):([\da-fA-F]{1,4}:){0,3}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){2}:([\da-fA-F]{1,4}:){0,2}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){3}:([\da-fA-F]{1,4}:){0,1}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){4}:((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){7}[\da-fA-F]{1,4}$|^:((:[\da-fA-F]{1,4}){1,6}|:)$|^[\da-fA-F]{1,4}:((:[\da-fA-F]{1,4}){1,5}|:)$|^([\da-fA-F]{1,4}:){2}((:[\da-fA-F]{1,4}){1,4}|:)$|^([\da-fA-F]{1,4}:){3}((:[\da-fA-F]{1,4}){1,3}|:)$|^([\da-fA-F]{1,4}:){4}((:[\da-fA-F]{1,4}){1,2}|:)$|^([\da-fA-F]{1,4}:){5}:([\da-fA-F]{1,4})?$|^([\da-fA-F]{1,4}:){6}:/,

	ipv6: /^([\da-fA-F]{1,4}:){6}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^::([\da-fA-F]{1,4}:){0,4}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:):([\da-fA-F]{1,4}:){0,3}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){2}:([\da-fA-F]{1,4}:){0,2}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){3}:([\da-fA-F]{1,4}:){0,1}((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){4}:((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$|^([\da-fA-F]{1,4}:){7}[\da-fA-F]{1,4}$|^:((:[\da-fA-F]{1,4}){1,6}|:)$|^[\da-fA-F]{1,4}:((:[\da-fA-F]{1,4}){1,5}|:)$|^([\da-fA-F]{1,4}:){2}((:[\da-fA-F]{1,4}){1,4}|:)$|^([\da-fA-F]{1,4}:){3}((:[\da-fA-F]{1,4}){1,3}|:)$|^([\da-fA-F]{1,4}:){4}((:[\da-fA-F]{1,4}){1,2}|:)$|^([\da-fA-F]{1,4}:){5}:([\da-fA-F]{1,4})?$|^([\da-fA-F]{1,4}:){6}:$/,

	/**
	 * @description 含有 url (链接)
	 */
	hasUrl: /https?:\/\/([\w-]+\.)+[\w-]+(\/[a-zA-Z-./?%&#=+\r\b ]*)?/,

	/**
	 * @description url (链接)
	 */
	url: /^https?:\/\/([\w-]+\.)+[\w-]+(\/[a-zA-Z-./?%&#=+\r\b ]*)?$/,

	/**
	 *  @description 含有 日期(yyyy-mm-dd)
	 */
	hasDate: /^[1-9]\d?-[0-1]\d?-[0-3]\d?$/,

	/**
	 *  @description 日期(yyyy-mm-dd)
	 */
	date: /^[1-9]\d?-[0-1]\d?-[0-3]\d?$/,

	/**
	 * @description 含有中国车牌
	 */
	hasLicensePlate: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,

	/**
	 * @description 中国车牌
	 */
	LicensePlate: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,

}